Revit 2027 API
ParameterTypeId.BoundaryXTranslationFixed Property
 "X Translation - Fixed"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryXTranslationFixed { get; }
Public Shared ReadOnly Property BoundaryXTranslationFixed As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryXTranslationFixed {
	ForgeTypeId^ get ();
}
static member BoundaryXTranslationFixed : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace